player = {
    "name": "",
    "armor": 0.975,
    "health": 40.0,
    "maxHealth": 40.0,
    "damage": 2.0,
    "luck": 5,
    "inventory": [],
    "equipment": 0,
    "money": 1250.0
}

enemies = [
    {
        "name": "Красный Муравей",
        "health": 5.0,
        "damage": [2.0],
        "script": "Красный Муравей Атакует!",
        "win":"Вы убили Красного Муравья!",
        "lose": "Вас убил Красный Муравей!",
        "prize": 500.0
    },
    {
        "name": "Небольшой Паук",
        "health": 9.0,
        "damage": [7.5],
        "script": "Небольшой Паук Атакует! *Пшшш!*",
        "win":"Вы убили Небольшого Паука! *Пшиу...*",
        "lose": "Вас убил Небольшой Паук! *Пшпшпш!*",
        "prize": 1000.0
    },
    {
        "name": "Сороконожка",
        "health": 14.0,
        "damage": [13.0],
        "script": "Сороконожка Атакует! *Перебирает ногами*",
        "win":"Вы убили Сороконожку! *Переворачивается лапами вверх*",
        "lose": "Вас убила Сороконожка *Встала на дыбы*",
        "prize": 1500.0
    },
    {
        "name": "Жук Навозник",
        "health": 25.0,
        "damage": [17.5],
        "script": "Жук Навозник Атакует! *Накатывает навоз*",
        "win":"Вы убили Жука Навозника! *Навоз растворился*",
        "lose": "Вас убил Жук Навозник! *Вы потонули в навозе*",
        "prize": 2000.0
    },
    {
        "name": "Оса",
        "health": 38.0,
        "damage": [20.0],
        "script": "Оса Атакует! *Бж Бж*",
        "win":"Вы убили Осу! *Бжыу...*",
        "lose": "Вас убила Оса! *Вы умерли в муках от яда*",
        "prize": 2500.0
    },
    {
        "name": "Шмель",
        "health": 47.0,
        "damage": [25.0,30.0],
        "script": "Шмель Атакует! *Бжж Бжж*",
        "win":"Вы убили Шмеля! *Бжжжыу...*",
        "lose": "Вас убил Шмель! *Вы умерли в муках от жала и укуса*",
        "prize": 3000.0
    },
]

def change_player(newPlayer):
    for stat in player:
        for newStat in newPlayer:
            if stat == newStat:
                player[stat] = newPlayer[newStat]